Repository: pakcusoft/ayuh-solat-flutter
Catalog: lib/l10n/app_*.arb
Languages: ms

source: Settings
ms: Tetapan

source: Language
ms: Bahasa

# languageSubtitle
source: Choose your preferred language
ms: Pilih bahasa pilihan anda

# languageSaved
source: Language saved: {language}
ms: Bahasa disimpan: {language}

source: Notifications
ms: Pemberitahuan

# notificationsSubtitle
source: Get reminded 10 minutes before prayer time and when it's time to pray.
ms: Dapatkan peringatan 10 minit sebelum waktu solat dan ketika tiba masa untuk solat.

source: Prayer Time Notifications
ms: Pemberitahuan Waktu Solat

# receiveNotifications
source: Receive notifications for prayer times
ms: Terima pemberitahuan untuk waktu solat

source: Adzan Sound
ms: Bunyi Azan

# playAdzanSound
source: Play adzan sound when prayer time arrives
ms: Mainkan bunyi azan ketika tiba waktu solat

source: Notifications enabled
ms: Pemberitahuan diaktifkan

source: Notifications disabled
ms: Pemberitahuan dimatikan

# adzanEnabled
source: Adzan sound enabled
ms: Bunyi azan diaktifkan

# adzanDisabled
source: Adzan sound disabled
ms: Bunyi azan dimatikan

source: Prayer Time Zone
ms: Zon Waktu Solat

source: Select Zone
ms: Pilih Zon

# selectLocation
source: Select your location to get accurate prayer times
ms: Pilih lokasi anda untuk mendapat waktu solat yang tepat

# zoneSaved
source: Zone saved: {zone}
ms: Zon disimpan: {zone}

source: Current Zone
ms: Zon Semasa

source: Prayer Schedule
ms: Jadual Solat

# viewWeeklySchedule
source: View prayer times for the upcoming week.
ms: Lihat waktu solat untuk minggu akan datang.

# viewWeeklyScheduleButton
source: View Weekly Schedule
ms: Lihat Jadual Mingguan

source: Notification Testing
ms: Ujian Pemberitahuan

source: About
ms: Mengenai

# aboutText
source: Prayer times are provided by JAKIM (Jabatan Kemajuan Islam Malaysia) e-Solat API.
ms: Waktu solat disediakan oleh API e-Solat JAKIM (Jabatan Kemajuan Islam Malaysia).

# dataUpdated
source: Data is updated in real-time.
ms: Data dikemaskini secara masa nyata.

source: Fajr
ms: Subuh

source: Dhuhr
ms: Zohor

source: Asr
ms: Asar

source: Isha
ms: Isyak

source: Today
ms: Hari Ini

source: Loading...
ms: Memuatkan...

# errorLoadingPrayerTimes
source: Failed to load prayer times
ms: Gagal memuatkan waktu solat

# errorLoadingPreferences
source: Error loading preferences: {error}
ms: Ralat memuatkan tetapan: {error}

# error
source: Error: {error}
ms: Ralat: {error}

source: Refresh
ms: Muat Semula

# lastUpdated
source: Last updated: {time}
ms: Kemaskini terakhir: {time}

source: Next Prayer
ms: Solat Seterusnya

source: Time Remaining
ms: Masa Berbaki

source: Current Prayer
ms: Solat Semasa

source: Prayer Reminder
ms: Peringatan Solat

# prayerReminderBody
source: Time for {prayer} prayer in 10 minutes
ms: Masa untuk solat {prayer} dalam 10 minit

source: Prayer Time
ms: Waktu Solat

# prayerTimeBody
source: It's time for {prayer} prayer
ms: Sudah tiba masa untuk solat {prayer}

source: Test Notification
ms: Pemberitahuan Ujian

# testNotificationBody
source: This is a test notification scheduled at {time}
ms: Ini adalah pemberitahuan ujian dijadualkan pada {time}
